## 2021: Week 34 - Excelling with lookups

As we come to the end of our excel challenges month, it seems only right to think about vlookups and index matches. In Excel, these are great functions for bringing together data from different worksheets without having to manually copy and paste. 

Our scenario this week is looking at Employee Sales at Allchains for each month of the year so far and we want to compare this to their Monthly Targets, stored on another sheet.

### Input
We have 2 inputs this week:
- Employee Sales
![img](https://lh3.googleusercontent.com/-YLkCUIZ-ewo/YSX2-_sNHkI/AAAAAAAAA5Y/LLKXwtA3zskTzUUNZORq8GSCo0TeI_pywCLcBGAsYHQ/w640-h150/image.png)

- Employee Targets
![img](https://lh3.googleusercontent.com/-dDch-RN5_KM/YSX3KZuKw5I/AAAAAAAAA5c/Uw76vgyf1gY4bQusHo0LCGSsN6FjsmBnQCLcBGAsYHQ/image.png)

### Requirement
- Input data
- Calculate the Average Monthly Sales for each employee
- In the Targets sheet the Store Name needs cleaning up
- Filter the data so that only employees who are below 90% of their target on average remain
- For these employees, we also want to know the % of months that they met/exceeded their target
- Output the data

### Output
![img](https://lh3.googleusercontent.com/-eztfs2p3UiU/YSX476gCsyI/AAAAAAAAA5o/KFMDSQML980A4JNi1KtJWL_XJi_YmPPjACLcBGAsYHQ/image.png)

- 5 fields
    - Store
    - Employee
    - Avg monthly Sales
    - % of months target met
    - Monthly Target
- 4 rows (5 including headers)

In [114]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

### Input data

In [115]:
data = pd.read_excel("./data/2021 Week 34 Input.xlsx", sheet_name=[0, 1])

In [116]:
employee_sales = data[0].copy()
employee_targets = data[1].copy()

In [117]:
### Calculate the Average Monthly Sales for each employee

In [118]:
employee_sales.head()

,Store,Employee,2021-01-01 00:00:00,2021-02-01 00:00:00,2021-03-01 00:00:00,2021-04-01 00:00:00,2021-05-01 00:00:00,2021-06-01 00:00:00,2021-07-01 00:00:00
0,Stratford,Julie,3302,3450,2642,4647,7493,5088,8414
1,Stratford,Pete,4052,2987,5328,8429,3616,5397,8588
2,Stratford,Jose,5226,1631,7497,2134,5814,895,5312
3,Stratford,Andre,9369,9255,1738,3543,8126,5953,3370
4,Stratford,Edward,7854,3059,9304,2304,5331,5928,8608

In [119]:
employee_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Store                35 non-null     object
 1   Employee             35 non-null     object
 2   2021-01-01 00:00:00  35 non-null     int64
 3   2021-02-01 00:00:00  35 non-null     int64
 4   2021-03-01 00:00:00  35 non-null     int64
 5   2021-04-01 00:00:00  35 non-null     int64
 6   2021-05-01 00:00:00  35 non-null     int64
 7   2021-06-01 00:00:00  35 non-null     int64
 8   2021-07-01 00:00:00  35 non-null     int64
dtypes: int64(7), object(2)
memory usage: 2.6+ KB

In [120]:
employee_targets.head()

       Store Employee  Monthly Target
0   Stratfod    Julie            5000
1  Stratford     Pete            5000
2  Stratford     Jose            5000
3  Stratfodd    Andre            6000
4  Stratford   Edward            6000

In [121]:
employee_targets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Store           35 non-null     object
 1   Employee        35 non-null     object
 2   Monthly Target  35 non-null     int64
dtypes: int64(1), object(2)
memory usage: 968.0+ bytes

In [122]:
employee_sales.columns

Index([            'Store',          'Employee', 2021-01-01 00:00:00,
       2021-02-01 00:00:00, 2021-03-01 00:00:00, 2021-04-01 00:00:00,
       2021-05-01 00:00:00, 2021-06-01 00:00:00, 2021-07-01 00:00:00],
      dtype='object')

In [123]:
columns_names = []
for i in employee_sales.columns:
    tmp = str(i)
    tmp = tmp.split()[0]
    tmp = tmp.strip()
    columns_names.append(tmp)

In [124]:
employee_sales.columns = columns_names
employee_sales

,Store,Employee,2021-01-01,2021-02-01,2021-03-01,2021-04-01,2021-05-01,2021-06-01,2021-07-01
0,Stratford,Julie,3302,3450,2642,4647,7493,5088,8414
1,Stratford,Pete,4052,2987,5328,8429,3616,5397,8588
2,Stratford,Jose,5226,1631,7497,2134,5814,895,5312
3,Stratford,Andre,9369,9255,1738,3543,8126,5953,3370
4,Stratford,Edward,7854,3059,9304,2304,5331,5928,8608
5,Stratford,Isla,583,5051,8761,8858,7924,4334,9074
6,Stratford,Ingrid,6020,2684,1261,6780,4539,9535,1594
7,Stratford,Jessie,7424,5931,8493,396,2689,1003,8761
8,Stratford,Ezra,7355,5338,1740,6676,6288,1373,5965
9,Stratford,Patrick,9790,5791,4978,8294,3155,5520,6961
10,Wimbledon,Edward,1570,3455,1976,8431,3930,3901,7472
11,Wimbledon,Francis,5773,2544,3232,2148,5068,8365,4000
12,Wimbledon,Oscar,3083,8507,159,466,6334,395,7639
13,Wimbledon,Olivia,6417,4767,2534,2653,9041,3605,1955
14,Wimbledon,Penelope,2910,9909,2483,4648,8549,89,6921
15,Wimbledon,Pete,5731,7932,8440,4981,3698,523,9101
16,Wimbledon,Quentin,3030,658,350,6304,4766,3492,5110
17,Wimbledon,Victoria,9168,6314,2935,2565,7399,482,8664
18,Wimbledon,Lily,6113,3893,1400,8848,580,9610,7033
19,Wimbledon,Angus,1554,8694,8137,7035,3828,6468,5740
20,Bristol,Cecilia,5266,9859,7948,4589,1049,2388,1319
21,Bristol,Rhys,9298,1596,488,5146,3293,4526,8893
22,Bristol,Olivia,6759,9924,8250,9131,9415,2914,740
23,Bristol,Jessie,7905,1250,3429,8534,2193,8105,5354
24,Bristol,Laura,8497,6900,1834,437,6919,6240,689
25,Bristol,Cat,2879,9257,9129,9108,9015,2439,4895
26,York,William,4246,4808,4472,5569,8047,5607,4559
27,York,Sophie,326,6558,2039,8859,8887,7397,3670
28,York,Molly,7633,5434,8711,4306,4401,5283,4592
29,York,Zack,6056,2088,4554,8833,1145,1483,7087
30,York,Jessie,92,9029,350,8545,9512,9417,7786
31,York,Xavier,7690,3835,6728,7383,2388,526,3619
32,York,Sam,8413,3121,2052,1300,3200,8923,1129
33,York,John,8535,7372,5601,9876,5266,6157,3452
34,York,Edward,5611,9200,6685,5070,1415,5762,6504